Tekla.Structures.ModelInternal.dotWire_t.RangeStart
Range start tells the first wire index.

Tekla.Structures.ModelInternal.dotWire_t.RangeEnd
Range end tells the last wire index.

Tekla.Structures.ModelInternal.dotWire_t.More
This variable tells whether there are more rebars to fetch.

Tekla.Structures.ModelInternal.dotWire_t.anPositionPoints
Indicates the number of polygon points for each wire.

Tekla.Structures.ModelInternal.dotWire_t.PolygonRangeStart
This variable tells first polygon point index in wire.

Tekla.Structures.ModelInternal.dotWire_t.nPointsInPolygon
This variable tells points there are in wire.